export const locale = () => {
	return {
		ru: {
			header: {
				title: 'С НОВЫМ 2022 ГОДОМ!',
				subtitle: `В честь праздника мы дарим скидки до <span class="header__text-span">50%</span> на товары недели и крупный денежный приз!`,
			},
			promotion: {
				title: 'НОВОГОДНЕЕ ЧУДО РЯДОМ',
				subtitle: 'ДО ОКОНЧАНИЯ АКЦИИ:',
				text: 'СЕЗОН МИЛЛИОНЕРОВ',
			},
			promotionRules: {
				title: `Каждую неделю разыгрывается <span style="white-space: nowrap">10 000 000 тенге</span> <span style="white-space: nowrap">по 1 миллиону</span> для 10 победителей!`,
				text: [
					'Покупай в Magnum на 10 000 тенге, предъявляй карту Magnum' +
					' Club \n',
					'Увеличивай свои шансы оплачивая покупку картой' +
					' Mastercard',
					'Покупай товары Партнёров, увеличивай шансы на выигрыш\n'],
				descr: [
					'*Чеки оплаченные Kaspi QR в розыгрыше не участвуют\n',
					'*Держатели Mastercard участвуют в 2 розыгрышах, но выиграть могут' +
					' только 1 приз\n'],
				btn: 'Правила акции',
			},
			products: {
				title: 'Товары партнеров',
				btn: 'Смотреть все товары',
			},
			winners: {
				title: 'Каждую неделю мы будем объявлять победителей розыгрыша!',
				subtitle: 'Следите за новостями на нашем сайте',
			},
			generalPartners: {
				title: 'Генеральный партнер',
			},
			partners: {
				title: 'Партнеры',
			},
			footer: {
				answer: 'Вы еще не в программе лояльности?',
				downloadText: 'Скачайте наше бесплатное приложение программы лояльности Magnum Club:',
				helpDesk: 'Справочная служба:',
				copyright: 'Все права защищены',
			},
		},
		kz: {
			header: {
				title: 'ЖАҢА 2022 ЖЫЛДАРЫҢЫЗБЕН!',
				subtitle: `Мереке құрметіне біз апта тауарларына <span class="header__text-span">50%-ға</span> дейінгі жеңілдіктер мен қомақты ақшалай жүлде сыйлаймыз!`,
			},
			promotion: {
				title: 'ЖАҢА ЖЫЛДЫҚ ҒАЖАЙЫП ЖАҚЫНДАП ҚАЛДЫ',
				subtitle: 'НАУҚАНЫНЫҢ АЯҚТАЛУЫНА ДЕЙІН:',
				text: 'МИЛЛИОНЕРЛЕР МАУСЫМЫ',
			},
			promotionRules: {
				title: `Әр апта сайын 10 жеңімпазға <span style="white-space: nowrap">1 миллион</span> теңгеден <span style="white-space: nowrap">10 000 000 теңге</span> ұтысқа салынады!`,
				text: [
					'Magnum-да 10 000 теңгеге сауда жасап, Magnum Club картасын' +
					' көрсетіңіздер',
					'Сауда ақысын Mastercard картасымен төлеп, өз' +
					' мүмкіндіктеріңізді арттырыңыздар',
					'Серіктестердің тауарларын сатып алып, ұту мүмкіндіктеріңізді арттырыңыздар'],
				descr: [
					'*Kaspi QR-мен төленген чектер ұтыс ойынына қатыспайды',
					'* Mastercard иелері 2 ұтыс ойынына қатысады, бірақ тек 1 жүлдені' +
					' ұта алады'],
				btn: 'Науқан ережелері',
			},
			products: {
				title: 'Серіктестер тауарлары',
				btn: 'Барлық тауарларды қарау',
			},
			winners: {
				title: 'Әр апта сайын ұтыс ойынының жеңімпаздарын жариялайтын боламыз!',
				subtitle: 'Сайтымыздағы жаңалықтарды қадағалап отырыңыздар',
			},
			generalPartners: {
				title: 'Бас серіктес',
			},
			partners: {
				title: 'Серіктестер',
			},
			footer: {
				answer: 'Сіз әлі бейілділік бағдарламасында жоқсыз ба?',
				downloadText: 'Біздің бейілділік бағдарламамыздың Magnum Club тегін қолданбасын жүктеп алыңыз:',
				helpDesk: 'Анықтамалық қызмет:',
				copyright: 'Барлық құқықтар қорғалған',
			},
		},
	};
};
